[Killed] BlockStatement
src/utils/NormalizeRow.ts:12:59
   category?: string | null;
 }
 
-export function normalizeRow(raw: unknown): NormalizedRow {
-  //row is treated as an object with unknown values
-  const record = raw as Record<string, unknown>;
-
-  const clean = (value: unknown): string | null => {
-    // helper to trim and clean string-like values
-    if (value === undefined || value === null) return null;
-    return String(value).trim() || null;
-  };
-  const rawDate = clean(record.date); // normalize fields using helpers
-  const date = normalizeDate(rawDate);
-  const rawAmount = clean(record.amount);
-  const amount = normalizeAmount(rawAmount);
-
-  return {
-    date,
-    description: clean(record.description),
-    amount,
-    sender: clean(record.sender),
-    recipient: clean(record.recipient),
-    category: clean(record.category),
-  };
-}
+export function normalizeRow(raw: unknown): NormalizedRow {}
 
 // helper to normalize date formats into YYYY-MM-DD
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected undefined to deeply equal { date: '2024-01-15', …(5) }

[Killed] BlockStatement
src/utils/NormalizeRow.ts:16:52
   //row is treated as an object with unknown values
   const record = raw as Record<string, unknown>;
 
-  const clean = (value: unknown): string | null => {
-    // helper to trim and clean string-like values
-    if (value === undefined || value === null) return null;
-    return String(value).trim() || null;
-  };
+  const clean = (value: unknown): string | null => {};
   const rawDate = clean(record.date); // normalize fields using helpers
   const date = normalizeDate(rawDate);
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected { date: null, …(5) } to deeply equal { date: '2024-01-15', …(5) }

[Killed] EqualityOperator
src/utils/NormalizeRow.ts:18:9
 
   const clean = (value: unknown): string | null => {
     // helper to trim and clean string-like values
-    if (value === undefined || value === null) return null;
+    if (value !== undefined || value === null) return null;
     return String(value).trim() || null;
   };
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected { date: null, description: null, …(4) } to deeply equal { date: '2024-01-15', …(5) }

[Killed] EqualityOperator
src/utils/NormalizeRow.ts:18:32
 
   const clean = (value: unknown): string | null => {
     // helper to trim and clean string-like values
-    if (value === undefined || value === null) return null;
+    if (value === undefined || value !== null) return null;
     return String(value).trim() || null;
   };
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected { date: null, description: null, …(4) } to deeply equal { date: '2024-01-15', …(5) }

[Killed] MethodExpression
src/utils/NormalizeRow.ts:19:12
   const clean = (value: unknown): string | null => {
     // helper to trim and clean string-like values
     if (value === undefined || value === null) return null;
-    return String(value).trim() || null;
+    return String(value) || null;
   };
   const rawDate = clean(record.date); // normalize fields using helpers
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected { date: '2024-01-15', …(5) } to deeply equal { date: '2024-01-15', …(5) }

[Killed] ConditionalExpression
src/utils/NormalizeRow.ts:19:12
   const clean = (value: unknown): string | null => {
     // helper to trim and clean string-like values
     if (value === undefined || value === null) return null;
-    return String(value).trim() || null;
+    return true;
   };
   const rawDate = clean(record.date); // normalize fields using helpers
killedBy: normalizeRow normalizes a fully valid row
statusReason: input.replace is not a function

[Killed] ObjectLiteral
src/utils/NormalizeRow.ts:26:10
   const rawAmount = clean(record.amount);
   const amount = normalizeAmount(rawAmount);
 
-  return {
-    date,
-    description: clean(record.description),
-    amount,
-    sender: clean(record.sender),
-    recipient: clean(record.recipient),
-    category: clean(record.category),
-  };
+  return {};
 }
 
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected {} to deeply equal { date: '2024-01-15', …(5) }

[Killed] BlockStatement
src/utils/NormalizeRow.ts:37:61
 }
 
 // helper to normalize date formats into YYYY-MM-DD
-function normalizeDate(input: string | null): string | null {
-  if (!input) return null;
-
-  // Replace separators with hyphens
-  const data = input.replace(/[.\s]/g, "-").replace(/\//g, "-");
-
-  // Already normalized YYYY-MM-DD
-  if (/^\d{4}-\d{2}-\d{2}$/.test(data)) return data;
-
-  // Match M-D-YYYY or MM-DD-YYYY
-  const mdY = /^(\d{1,2})-(\d{1,2})-(\d{4})$/;
-  const match = data.match(mdY);
-
-  if (match) {
-    const [, mRaw, dRaw, y] = match;
-
-    const m = mRaw.padStart(2, "0");
-    const d = dRaw.padStart(2, "0");
-
-    return `${y}-${m}-${d}`;
-  }
-
-  return null;
-}
+function normalizeDate(input: string | null): string | null {}
 // helper to normalize amount fields
 
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected { date: undefined, …(5) } to deeply equal { date: '2024-01-15', …(5) }

[Killed] ConditionalExpression
src/utils/NormalizeRow.ts:38:7
 
 // helper to normalize date formats into YYYY-MM-DD
 function normalizeDate(input: string | null): string | null {
-  if (!input) return null;
+  if (false) return null;
 
   // Replace separators with hyphens
killedBy: normalizeRow handles null and undefined fields
statusReason: Cannot read properties of null (reading 'replace')

[Killed] ConditionalExpression
src/utils/NormalizeRow.ts:38:7
 
 // helper to normalize date formats into YYYY-MM-DD
 function normalizeDate(input: string | null): string | null {
-  if (!input) return null;
+  if (true) return null;
 
   // Replace separators with hyphens
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected { date: null, …(5) } to deeply equal { date: '2024-01-15', …(5) }

[Killed] ConditionalExpression
src/utils/NormalizeRow.ts:44:7
   const data = input.replace(/[.\s]/g, "-").replace(/\//g, "-");
 
   // Already normalized YYYY-MM-DD
-  if (/^\d{4}-\d{2}-\d{2}$/.test(data)) return data;
+  if (true) return data;
 
   // Match M-D-YYYY or MM-DD-YYYY
killedBy: normalizeRow normalizes MM-DD-YYYY date format
statusReason: expected '01-31-2024' to be '2024-01-31' // Object.is equality

[Killed] ConditionalExpression
src/utils/NormalizeRow.ts:44:7
   const data = input.replace(/[.\s]/g, "-").replace(/\//g, "-");
 
   // Already normalized YYYY-MM-DD
-  if (/^\d{4}-\d{2}-\d{2}$/.test(data)) return data;
+  if (false) return data;
 
   // Match M-D-YYYY or MM-DD-YYYY
killedBy: normalizeRow normalizes a fully valid row
statusReason: expected { date: null, …(5) } to deeply equal { date: '2024-01-15', …(5) }

[Killed] Regex
src/utils/NormalizeRow.ts:47:15
   if (/^\d{4}-\d{2}-\d{2}$/.test(data)) return data;
 
   // Match M-D-YYYY or MM-DD-YYYY
-  const mdY = /^(\d{1,2})-(\d{1,2})-(\d{4})$/;
+  const mdY = /^(\d{1,2})-(\d{1,2})-(\D{4})$/;
   const match = data.match(mdY);
 
killedBy: normalizeRow normalizes MM-DD-YYYY date format
statusReason: expected null to be '2024-01-31' // Object.is equality

[Killed] Regex
src/utils/NormalizeRow.ts:47:15
   if (/^\d{4}-\d{2}-\d{2}$/.test(data)) return data;
 
   // Match M-D-YYYY or MM-DD-YYYY
-  const mdY = /^(\d{1,2})-(\d{1,2})-(\d{4})$/;
+  const mdY = /(\d{1,2})-(\d{1,2})-(\d{4})$/;
   const match = data.match(mdY);
 
killedBy: rejects MM-DD-YYYY with extra characters before
statusReason: expected '2024-01-31' to be null

[Killed] ConditionalExpression
src/utils/NormalizeRow.ts:50:7
   const mdY = /^(\d{1,2})-(\d{1,2})-(\d{4})$/;
   const match = data.match(mdY);
 
-  if (match) {
+  if (false) {
     const [, mRaw, dRaw, y] = match;
 
killedBy: normalizeRow normalizes MM-DD-YYYY date format
statusReason: expected null to be '2024-01-31' // Object.is equality

[Killed] ConditionalExpression
src/utils/NormalizeRow.ts:50:7
   const mdY = /^(\d{1,2})-(\d{1,2})-(\d{4})$/;
   const match = data.match(mdY);
 
-  if (match) {
+  if (true) {
     const [, mRaw, dRaw, y] = match;
 
killedBy: normalizeRow returns null for invalid dates
statusReason: match is not iterable

[Killed] StringLiteral
src/utils/NormalizeRow.ts:53:32
   if (match) {
     const [, mRaw, dRaw, y] = match;
 
-    const m = mRaw.padStart(2, "0");
+    const m = mRaw.padStart(2, "");
     const d = dRaw.padStart(2, "0");
 
killedBy: pads single-digit month and day
statusReason: expected '2024-1-02' to be '2024-01-02' // Object.is equality
