[Killed] BlockStatement
src/utils/ValidateFile.ts:12:78
   tooManyInvalid: boolean;
 }
 
-export function validateFile(rows: TransactionDraft[]): FileValidationResult {
-  //returns a summary of validation results for the whole file
-  const validCount = rows.filter((r) => r.errors.length === 0).length;
-  const invalidCount = rows.length - validCount;
-  // Stryker disable all
-  const tooManyInvalid =
-    rows.length === 0 ? false : invalidCount / rows.length > 0.2; //if more than 20% of the rows are invalid we send a warning
-
-  return {
-    validCount,
-    invalidCount,
-    tooManyInvalid,
-  };
-}
+export function validateFile(rows: TransactionDraft[]): FileValidationResult {}
 
killedBy: validateFile returns correct counts when all rows are valid
statusReason: expected undefined to deeply equal { validCount: 2, …(2) }

[Killed] ConditionalExpression
src/utils/ValidateFile.ts:14:41
 
 export function validateFile(rows: TransactionDraft[]): FileValidationResult {
   //returns a summary of validation results for the whole file
-  const validCount = rows.filter((r) => r.errors.length === 0).length;
+  const validCount = rows.filter((r) => true).length;
   const invalidCount = rows.length - validCount;
   // Stryker disable all
killedBy: validateFile returns correct counts when all rows are invalid
statusReason: expected { validCount: 2, …(2) } to deeply equal { validCount: +0, …(2) }

[Killed] EqualityOperator
src/utils/ValidateFile.ts:14:41
 
 export function validateFile(rows: TransactionDraft[]): FileValidationResult {
   //returns a summary of validation results for the whole file
-  const validCount = rows.filter((r) => r.errors.length === 0).length;
+  const validCount = rows.filter((r) => r.errors.length !== 0).length;
   const invalidCount = rows.length - validCount;
   // Stryker disable all
killedBy: validateFile returns correct counts when all rows are valid
statusReason: expected { validCount: +0, …(2) } to deeply equal { validCount: 2, …(2) }

[Killed] ArithmeticOperator
src/utils/ValidateFile.ts:15:24
 export function validateFile(rows: TransactionDraft[]): FileValidationResult {
   //returns a summary of validation results for the whole file
   const validCount = rows.filter((r) => r.errors.length === 0).length;
-  const invalidCount = rows.length - validCount;
+  const invalidCount = rows.length + validCount;
   // Stryker disable all
   const tooManyInvalid =
killedBy: validateFile returns correct counts when all rows are valid
statusReason: expected { Object (validCount, invalidCount, ...) } to deeply equal { validCount: 2, …(2) }
