[Killed] BlockStatement
src/utils/ConvertTransaction.ts:16:68
   errors: string[];
 }
 
-export function convertDraft(row: NormalizedRow): TransactionDraft {
-  // convert normalized row to transaction draft and validate it
-  const errors = validateRow(row);
-
-  return {
-    ...row,
-    errors,
-  };
-}
+export function convertDraft(row: NormalizedRow): TransactionDraft {}
 
killedBy: convertDraft returns a valid TransactionDraft when the row is valid
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] ObjectLiteral
src/utils/ConvertTransaction.ts:20:10
   // convert normalized row to transaction draft and validate it
   const errors = validateRow(row);
 
-  return {
-    ...row,
-    errors,
-  };
+  return {};
 }
 
killedBy: convertDraft returns a valid TransactionDraft when the row is valid
statusReason: expected undefined to deeply equal []
