[Killed] BooleanLiteral
src/utils/ParseCsv.ts:12:15
   //uses promises to handle async parsing
   return new Promise((resolve, reject) => {
     Papa.parse(file, {
-      header: true,
+      header: false,
       skipEmptyLines: true,
       dynamicTyping: true,
killedBy: parseCsvFile calls Papa.parse with correct config
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -6,13 +6,15 @@
      Symbol(state): FileState {

[Killed] BooleanLiteral
src/utils/ParseCsv.ts:13:23
   return new Promise((resolve, reject) => {
     Papa.parse(file, {
       header: true,
-      skipEmptyLines: true,
+      skipEmptyLines: false,
       dynamicTyping: true,
       beforeFirstChunk: (chunk) => chunk.replace(/^\uFEFF/, ""),
killedBy: parseCsvFile calls Papa.parse with correct config
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -6,13 +6,15 @@
      Symbol(state): FileState {

[Killed] BooleanLiteral
src/utils/ParseCsv.ts:14:22
     Papa.parse(file, {
       header: true,
       skipEmptyLines: true,
-      dynamicTyping: true,
+      dynamicTyping: false,
       beforeFirstChunk: (chunk) => chunk.replace(/^\uFEFF/, ""),
       transformHeader: (header) => header.trim().toLowerCase(),
killedBy: parseCsvFile calls Papa.parse with correct config
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -6,13 +6,15 @@
      Symbol(state): FileState {

[Killed] ArrowFunction
src/utils/ParseCsv.ts:15:25
       header: true,
       skipEmptyLines: true,
       dynamicTyping: true,
-      beforeFirstChunk: (chunk) => chunk.replace(/^\uFEFF/, ""),
+      beforeFirstChunk: () => undefined,
       transformHeader: (header) => header.trim().toLowerCase(),
 
killedBy: removes BOM using beforeFirstChunk
statusReason: expected undefined to be 'a,b,c' // Object.is equality

[Killed] Regex
src/utils/ParseCsv.ts:15:50
       header: true,
       skipEmptyLines: true,
       dynamicTyping: true,
-      beforeFirstChunk: (chunk) => chunk.replace(/^\uFEFF/, ""),
+      beforeFirstChunk: (chunk) => chunk.replace(/\uFEFF/, ""),
       transformHeader: (header) => header.trim().toLowerCase(),
 
killedBy: does not remove BOM when it is not at the start
statusReason: expected 'a,b,c' to be 'a\ufeff,b,c' // Object.is equality

[Killed] MethodExpression
src/utils/ParseCsv.ts:16:36
       skipEmptyLines: true,
       dynamicTyping: true,
       beforeFirstChunk: (chunk) => chunk.replace(/^\uFEFF/, ""),
-      transformHeader: (header) => header.trim().toLowerCase(),
+      transformHeader: (header) => header.toLowerCase(),
 
       complete: (result: ParseResult<unknown>) => {
killedBy: normalizes headers using transformHeader
statusReason: expected '  amount ' to be 'amount' // Object.is equality

[Killed] MethodExpression
src/utils/ParseCsv.ts:16:36
       skipEmptyLines: true,
       dynamicTyping: true,
       beforeFirstChunk: (chunk) => chunk.replace(/^\uFEFF/, ""),
-      transformHeader: (header) => header.trim().toLowerCase(),
+      transformHeader: (header) => header.trim().toUpperCase(),
 
       complete: (result: ParseResult<unknown>) => {
killedBy: normalizes headers using transformHeader
statusReason: expected 'AMOUNT' to be 'amount' // Object.is equality

[Killed] BlockStatement
src/utils/ParseCsv.ts:18:51
       beforeFirstChunk: (chunk) => chunk.replace(/^\uFEFF/, ""),
       transformHeader: (header) => header.trim().toLowerCase(),
 
-      complete: (result: ParseResult<unknown>) => {
-        // handle parsing errors
-        const { data, errors } = result;
-        if (errors.length > 0) {
-          reject(errors[0].message);
-          return;
-        }
-
-        const drafts: TransactionDraft[] = data.map((raw: unknown) => {
-          // normalize and convert each row to a transaction draft
-          const normalized = normalizeRow(raw);
-          return convertDraft(normalized);
-        });
-
-        resolve(drafts); // resolve with array of transaction drafts, each containing validation errors if any
-      },
+      complete: (result: ParseResult<unknown>) => {},
 
       error: (err: Error) => reject(err.message), // handle file read errors
killedBy: parseCsvFile resolves with converted drafts when parsing succeeds
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/utils/ParseCsv.ts:21:13
       complete: (result: ParseResult<unknown>) => {
         // handle parsing errors
         const { data, errors } = result;
-        if (errors.length > 0) {
+        if (errors.length >= 0) {
           reject(errors[0].message);
           return;
killedBy: parseCsvFile resolves with converted drafts when parsing succeeds
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/utils/ParseCsv.ts:21:13
       complete: (result: ParseResult<unknown>) => {
         // handle parsing errors
         const { data, errors } = result;
-        if (errors.length > 0) {
+        if (false) {
           reject(errors[0].message);
           return;
killedBy: parseCsvFile rejects when Papa.parse returns errors
statusReason: promise resolved "[]" instead of rejecting

[Killed] BlockStatement
src/utils/ParseCsv.ts:26:71
           return;
         }
 
-        const drafts: TransactionDraft[] = data.map((raw: unknown) => {
-          // normalize and convert each row to a transaction draft
-          const normalized = normalizeRow(raw);
-          return convertDraft(normalized);
-        });
+        const drafts: TransactionDraft[] = data.map((raw: unknown) => {});
 
         resolve(drafts); // resolve with array of transaction drafts, each containing validation errors if any
killedBy: parseCsvFile resolves with converted drafts when parsing succeeds
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ArrowFunction
src/utils/ParseCsv.ts:35:14
         resolve(drafts); // resolve with array of transaction drafts, each containing validation errors if any
       },
 
-      error: (err: Error) => reject(err.message), // handle file read errors
+      error: () => undefined, // handle file read errors
     });
   });
killedBy: parseCsvFile rejects when Papa.parse triggers its error callback
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
