[Killed] BlockStatement
src/utils/ValidateRow.ts:5:59
 
 import type { NormalizedRow } from "./NormalizeRow";
 
-export function validateRow(row: NormalizedRow): string[] {
-  const errors: string[] = [];
-
-  // validate date
-  if (!row.date) {
-    errors.push("Invalid or missing date");
-  }
-
-  // validate description
-  if (!row.description) {
-    errors.push("Missing description");
-  }
-
-  // validate amount
-  if (row.amount === null) {
-    errors.push("Invalid or missing amount");
-  }
-
-  return errors;
-}
+export function validateRow(row: NormalizedRow): string[] {}
 
killedBy: validateRow returns no errors for a fully valid row
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
src/utils/ValidateRow.ts:9:7
   const errors: string[] = [];
 
   // validate date
-  if (!row.date) {
+  if (row.date) {
     errors.push("Invalid or missing date");
   }
killedBy: validateRow returns no errors for a fully valid row
statusReason: expected [ 'Invalid or missing date' ] to deeply equal []

[Killed] ConditionalExpression
src/utils/ValidateRow.ts:9:7
   const errors: string[] = [];
 
   // validate date
-  if (!row.date) {
+  if (false) {
     errors.push("Invalid or missing date");
   }
killedBy: validateRow reports missing or invalid date
statusReason: expected [] to include 'Invalid or missing date'

[Killed] ConditionalExpression
src/utils/ValidateRow.ts:14:7
   }
 
   // validate description
-  if (!row.description) {
+  if (true) {
     errors.push("Missing description");
   }
killedBy: validateRow returns no errors for a fully valid row
statusReason: expected [ 'Missing description' ] to deeply equal []

[Killed] BlockStatement
src/utils/ValidateRow.ts:14:25
   }
 
   // validate description
-  if (!row.description) {
-    errors.push("Missing description");
-  }
+  if (!row.description) {}
 
   // validate amount
killedBy: validateRow reports missing description
statusReason: expected [] to include 'Missing description'

[Killed] ConditionalExpression
src/utils/ValidateRow.ts:19:7
   }
 
   // validate amount
-  if (row.amount === null) {
+  if (true) {
     errors.push("Invalid or missing amount");
   }
killedBy: validateRow returns no errors for a fully valid row
statusReason: expected [ 'Invalid or missing amount' ] to deeply equal []

[Killed] EqualityOperator
src/utils/ValidateRow.ts:19:7
   }
 
   // validate amount
-  if (row.amount === null) {
+  if (row.amount !== null) {
     errors.push("Invalid or missing amount");
   }
killedBy: validateRow returns no errors for a fully valid row
statusReason: expected [ 'Invalid or missing amount' ] to deeply equal []

[Killed] StringLiteral
src/utils/ValidateRow.ts:20:17
 
   // validate amount
   if (row.amount === null) {
-    errors.push("Invalid or missing amount");
+    errors.push("");
   }
 
killedBy: validateRow reports missing or invalid amount
statusReason: expected [ '' ] to include 'Invalid or missing amount'
