[Killed] BlockStatement
src/utils/handleInput.ts:7:12
 export const handleCurrencyChange = (
   event: React.ChangeEvent<HTMLInputElement>,
   setCurrency: React.Dispatch<React.SetStateAction<string>>,
-): void => {
-  let input = event.target.value;
-  const pattern = /^\d*\.?\d{0,2}$/;
-
-  console.log(input);
-  console.log(pattern.test(input));
-  //Determine if the input follows the format/pattern
-  if (pattern.test(input)) {
-    input = input.replace(/^0+(?=\d)/, "");
-    setCurrency(input);
-  }
-};
+): void => {};
 
 export const handleCurrencyBlur = (
killedBy: handleCurrencyChange accepts valid currency input
statusReason: expected "vi.fn()" to be called with arguments: [ '12.34' ]

Number of calls: 0

[Killed] Regex
src/utils/handleInput.ts:9:19
   setCurrency: React.Dispatch<React.SetStateAction<string>>,
 ): void => {
   let input = event.target.value;
-  const pattern = /^\d*\.?\d{0,2}$/;
+  const pattern = /^\d\.?\d{0,2}$/;
 
   console.log(input);
killedBy: handleCurrencyChange accepts valid currency input
statusReason: expected "vi.fn()" to be called with arguments: [ '12.34' ]

Number of calls: 0

[Killed] Regex
src/utils/handleInput.ts:9:19
   setCurrency: React.Dispatch<React.SetStateAction<string>>,
 ): void => {
   let input = event.target.value;
-  const pattern = /^\d*\.?\d{0,2}$/;
+  const pattern = /^\d*\.?\d$/;
 
   console.log(input);
killedBy: handleCurrencyChange accepts valid currency input
statusReason: expected "vi.fn()" to be called with arguments: [ '12.34' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/handleInput.ts:14:7
   console.log(input);
   console.log(pattern.test(input));
   //Determine if the input follows the format/pattern
-  if (pattern.test(input)) {
+  if (false) {
     input = input.replace(/^0+(?=\d)/, "");
     setCurrency(input);
killedBy: handleCurrencyChange accepts valid currency input
statusReason: expected "vi.fn()" to be called with arguments: [ '12.34' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/handleInput.ts:14:28
   console.log(input);
   console.log(pattern.test(input));
   //Determine if the input follows the format/pattern
-  if (pattern.test(input)) {
-    input = input.replace(/^0+(?=\d)/, "");
-    setCurrency(input);
-  }
+  if (pattern.test(input)) {}
 };
 
killedBy: handleCurrencyChange accepts valid currency input
statusReason: expected "vi.fn()" to be called with arguments: [ '12.34' ]

Number of calls: 0

[Killed] StringLiteral
src/utils/handleInput.ts:15:40
   console.log(pattern.test(input));
   //Determine if the input follows the format/pattern
   if (pattern.test(input)) {
-    input = input.replace(/^0+(?=\d)/, "");
+    input = input.replace(/^0+(?=\d)/, "Stryker was here!");
     setCurrency(input);
   }
killedBy: handleCurrencyChange strips leading zeros
statusReason: expected "vi.fn()" to be called with arguments: [ '45.20' ]

Received:

  1st vi.fn() call:

  [
-   "45.20",

[Killed] BlockStatement
src/utils/handleInput.ts:24:12
   event: React.ChangeEvent<HTMLInputElement>,
   currency: string,
   setCurrency: React.Dispatch<React.SetStateAction<string>>,
-): void => {
-  if (event.target.value !== "") {
-    setCurrency(parseFloat(currency).toFixed(2));
-  }
-};
+): void => {};
 
killedBy: handleCurrencyBlur formats to two decimals on blur
statusReason: expected "vi.fn()" to be called with arguments: [ '12.30' ]

Number of calls: 0

[Killed] EqualityOperator
src/utils/handleInput.ts:25:7
   currency: string,
   setCurrency: React.Dispatch<React.SetStateAction<string>>,
 ): void => {
-  if (event.target.value !== "") {
+  if (event.target.value === "") {
     setCurrency(parseFloat(currency).toFixed(2));
   }
killedBy: handleCurrencyBlur formats to two decimals on blur
statusReason: expected "vi.fn()" to be called with arguments: [ '12.30' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/handleInput.ts:25:7
   currency: string,
   setCurrency: React.Dispatch<React.SetStateAction<string>>,
 ): void => {
-  if (event.target.value !== "") {
+  if (true) {
     setCurrency(parseFloat(currency).toFixed(2));
   }
killedBy: handleCurrencyBlur does nothing when input is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "NaN",
